ExoSpaceLabs/spwkit/integrations/stm32h755_dma/firmware.c
// SPDX-License-Identifier: Apache-2.0

#include <spwkit/driver.h>
#include <spwkit/spwkit.h>

#include "stm32h755xx.h"

#ifdef SPWKIT_STM32_PROFILE
#include "profiling/profile.h"
#define STM32_PROFILE_DMA_SUBMITTED() do { \
    SPW_PROFILE_TX_PROVIDER_BOUNDARY(); \
    SPW_PROFILE_TX_ZC_SUBMIT_PROVIDER_BOUNDARY(); \
} while (0)
#define STM32_PROFILE_DMA_COMPLETE() do { \
    SPW_PROFILE_RX_PROVIDER_BOUNDARY(); \
    SPW_PROFILE_RX_ZC_ACQUIRE_PROVIDER_BOUNDARY(); \
    SPW_PROFILE_TX_ZC_RECLAIM_PROVIDER_BOUNDARY(); \
} while (0)
#else
#define STM32_PROFILE_DMA_SUBMITTED() ((void)0)
#define STM32_PROFILE_DMA_COMPLETE() ((void)0)
#endif

#include <stdalign.h>
#include <stddef.h>
#include <stdint.h>

#define STM32_DMA_PACKET_CAPACITY 256u
#define STM32_WORKSPACE_BYTES 4096u
#define STM32_DMA_TIMEOUT_SPINS 10000000u
#define STM32_EVIDENCE_MAGIC UINT32_C(0x53505736) /* "SPW6" */

extern uint32_t __StackTop;
extern uint32_t __data_load__;
extern uint32_t __data_start__;
extern uint32_t __data_end__;
extern uint32_t __bss_start__;
extern uint32_t __bss_end__;
extern uint32_t __dma_buffer_start__;
extern uint32_t __dma_buffer_end__;

void Reset_Handler(void);

__attribute__((section(".isr_vector"), used, aligned(256)))
const uintptr_t g_stm32h755_vector_table[16] = {
    (uintptr_t)&__StackTop,
    (uintptr_t)&Reset_Handler,
    0u, 0u, 0u, 0u, 0u, 0u,
    0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u,
};

typedef enum stm32_dma_owner {
    STM32_DMA_FREE = 0,
    STM32_DMA_TX_APP,
    STM32_DMA_TX_DEVICE,
    STM32_DMA_TX_COMPLETE,
    STM32_DMA_RX_DEVICE,
    STM32_DMA_RX_READY,
    STM32_DMA_RX_APP
} stm32_dma_owner_t;

typedef struct stm32_driver_state {
    spw_link_state_t link_state;
    stm32_dma_owner_t tx_owner;
    stm32_dma_owner_t rx_owner;
    size_t transfer_length;
    spw_terminator_t transfer_terminator;
    spw_statistics_t statistics;
    uint32_t sync_to_device;
    uint32_t sync_from_device;
    uint32_t dma_transfers;
} stm32_driver_state_t;

typedef struct stm32_evidence {
    uint32_t magic;
    volatile uint32_t phase;
    volatile uint32_t result;
    volatile uint32_t sync_to_device;
    volatile uint32_t sync_from_device;
    volatile uint32_t dma_transfers;
    volatile uint32_t tx_packets;
    volatile uint32_t rx_packets;
    volatile uint32_t reset_stale_invalidated;
} stm32_evidence_t;

/* Public debugger/HIL evidence symbol. result=0 means the firmware completed
 * the MCU driver contract. Values >= 0x100 identify the failing phase. */
volatile stm32_evidence_t g_stm32h755_spwkit_evidence = {
    STM32_EVIDENCE_MAGIC,
    0u,
    UINT32_C(0xffffffff),
    0u, 0u, 0u, 0u, 0u, 0u
};

static alignas(max_align_t) uint8_t g_workspace[STM32_WORKSPACE_BYTES];
static stm32_driver_state_t g_driver;

/* DMA-owned storage is deliberately outside AXI workspace/state and outside
 * TCM. D2 SRAM is reachable by DMA2 on STM32H755. */
__attribute__((section(".dma_buffer"), aligned(32), used))
static uint8_t g_dma_tx[STM32_DMA_PACKET_CAPACITY];
__attribute__((section(".dma_buffer"), aligned(32), used))
static uint8_t g_dma_rx[STM32_DMA_PACKET_CAPACITY];

static const spw_driver_buffer_token_t TX_TOKEN = UINT64_C(0x75510001);
static const spw_driver_buffer_token_t RX_TOKEN = UINT64_C(0x75520001);

static void memory_init(void) {
    uint32_t* source = &__data_load__;
    uint32_t* destination = &__data_start__;
    while (destination < &__data_end__) {
        *destination++ = *source++;
    }

    destination = &__bss_start__;
    while (destination < &__bss_end__) {
        *destination++ = 0u;
    }

    destination = &__dma_buffer_start__;
    while (destination < &__dma_buffer_end__) {
        *destination++ = 0u;
    }
}

static void bytes_copy(uint8_t* destination, const uint8_t* source, size_t size) {
    size_t index;
    for (index = 0u; index < size; ++index) {
        destination[index] = source[index];
    }
}

static int bytes_equal(const uint8_t* lhs, const uint8_t* rhs, size_t size) {
    size_t index;
    for (index = 0u; index < size; ++index) {
        if (lhs[index] != rhs[index]) {
            return 0;
        }
    }
    return 1;
}

static uintptr_t cache_line_start(const void* pointer) {
    return ((uintptr_t)pointer) & ~(uintptr_t)31u;
}

static int32_t cache_line_span(const void* pointer, size_t size) {
    const uintptr_t start = cache_line_start(pointer);
    const uintptr_t end = ((uintptr_t)pointer + size + 31u) & ~(uintptr_t)31u;
    return (int32_t)(end - start);
}

static void clean_cache(const void* pointer, size_t size) {
    if (size != 0u) {
        SCB_CleanDCache_by_Addr((void*)cache_line_start(pointer),
                                cache_line_span(pointer, size));
        __DSB();
    }
}

static void invalidate_cache(const void* pointer, size_t size) {
    if (size != 0u) {
        SCB_InvalidateDCache_by_Addr((void*)cache_line_start(pointer),
                                     cache_line_span(pointer, size));
        __DSB();
    }
}

static void dma_clear_stream0_flags(void) {
    DMA2->LIFCR = DMA_LIFCR_CFEIF0 |
                  DMA_LIFCR_CDMEIF0 |
                  DMA_LIFCR_CTEIF0 |
                  DMA_LIFCR_CHTIF0 |
                  DMA_LIFCR_CTCIF0;
}

static int dma_has_error(void) {
    return (DMA2->LISR & (DMA_LISR_TEIF0 | DMA_LISR_DMEIF0 | DMA_LISR_FEIF0)) != 0u;
}

static int dma_complete(void) {
    return (DMA2->LISR & DMA_LISR_TCIF0) != 0u;
}

static int dma_wait_complete(void) {
    uint32_t spins = STM32_DMA_TIMEOUT_SPINS;
    while (!dma_complete()) {
        if (dma_has_error() || spins-- == 0u) {
            return 0;
        }
    }
    return 1;
}

static int dma_start_copy(size_t length) {
    if (length > STM32_DMA_PACKET_CAPACITY) {
        return 0;
    }
    if (length == 0u) {
        STM32_PROFILE_DMA_SUBMITTED();
        return 1;
    }

    DMA2_Stream0->CR &= ~DMA_SxCR_EN;
    while ((DMA2_Stream0->CR & DMA_SxCR_EN) != 0u) {
    }

    dma_clear_stream0_flags();
    DMA2_Stream0->PAR = (uint32_t)(uintptr_t)g_dma_tx;
    DMA2_Stream0->M0AR = (uint32_t)(uintptr_t)g_dma_rx;
    DMA2_Stream0->NDTR = (uint32_t)length;
    DMA2_Stream0->FCR = 0u;
    DMA2_Stream0->CR = DMA_SxCR_DIR_1 |
                       DMA_SxCR_PINC |
                       DMA_SxCR_MINC |
                       DMA_SxCR_PL_1;
    __DSB();
    DMA2_Stream0->CR |= DMA_SxCR_EN;
    STM32_PROFILE_DMA_SUBMITTED();
    return 1;
}

static void driver_poll_completion(stm32_driver_state_t* state) {
    if (state->tx_owner != STM32_DMA_TX_DEVICE || !dma_complete()) {
        return;
    }

    DMA2_Stream0->CR &= ~DMA_SxCR_EN;
    dma_clear_stream0_flags();
    state->tx_owner = STM32_DMA_TX_COMPLETE;
    state->rx_owner = STM32_DMA_RX_READY;
    ++state->dma_transfers;
    STM32_PROFILE_DMA_COMPLETE();
}

