ExoSpaceLabs/spwkit/integrations/stm32h755_dma/firmware.c
static spw_result_t driver_start(void* raw) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    if (state == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    state->link_state = SPW_LINK_RUN;
    return SPW_OK;
}

static spw_result_t driver_stop(void* raw) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    if (state == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    state->link_state = SPW_LINK_READY;
    return SPW_OK;
}

static spw_result_t driver_reset(void* raw) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    if (state == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    DMA2_Stream0->CR &= ~DMA_SxCR_EN;
    dma_clear_stream0_flags();
    state->link_state = SPW_LINK_ERROR_RESET;
    state->tx_owner = STM32_DMA_FREE;
    state->rx_owner = STM32_DMA_FREE;
    state->transfer_length = 0u;
    return SPW_OK;
}

static spw_result_t driver_get_link_state(const void* raw,
                                          spw_link_state_t* out_state) {
    const stm32_driver_state_t* state = (const stm32_driver_state_t*)raw;
    if (state == NULL || out_state == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    *out_state = state->link_state;
    return SPW_OK;
}

static spw_result_t driver_get_capabilities(const void* raw,
                                            spw_capabilities_t* out_caps) {
    (void)raw;
    if (out_caps == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    *out_caps = (spw_capabilities_t){0};
    out_caps->bits = SPW_CAP_EEP |
                     SPW_CAP_LINK_CONTROL |
                     SPW_CAP_STATISTICS |
                     SPW_CAP_ZERO_COPY;
    out_caps->max_packet_size = STM32_DMA_PACKET_CAPACITY;
    out_caps->tx_queue_depth = 1u;
    out_caps->rx_queue_depth = 1u;
    out_caps->buffer_alignment = 32u;
    return SPW_OK;
}

static spw_result_t driver_send(void* raw,
                                const spw_packet_t* packet,
                                spw_timeout_us_t timeout_us) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    (void)timeout_us;

    if (state == NULL || packet == NULL ||
        (packet->length != 0u && packet->data == NULL)) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    if (state->link_state != SPW_LINK_RUN) {
        return SPW_ERR_INVALID_STATE;
    }
    if (state->tx_owner != STM32_DMA_FREE || state->rx_owner != STM32_DMA_FREE) {
        return SPW_ERR_RESOURCE_EXHAUSTED;
    }
    if (packet->length > sizeof(g_dma_tx)) {
        return SPW_ERR_INVALID_PACKET;
    }

    bytes_copy(g_dma_tx, packet->data, packet->length);
    clean_cache(g_dma_tx, packet->length);
    invalidate_cache(g_dma_rx, packet->length);
    state->transfer_length = packet->length;
    state->transfer_terminator = packet->terminator;
    state->tx_owner = STM32_DMA_TX_DEVICE;
    state->rx_owner = STM32_DMA_RX_DEVICE;

    if (!dma_start_copy(packet->length) ||
        (packet->length != 0u && !dma_wait_complete())) {
        state->tx_owner = STM32_DMA_FREE;
        state->rx_owner = STM32_DMA_FREE;
        ++state->statistics.link_errors;
        return SPW_ERR_BACKEND;
    }
    if (packet->length == 0u) {
        state->tx_owner = STM32_DMA_TX_COMPLETE;
        state->rx_owner = STM32_DMA_RX_READY;
        ++state->dma_transfers;
        STM32_PROFILE_DMA_COMPLETE();
    } else {
        driver_poll_completion(state);
    }
    invalidate_cache(g_dma_rx, packet->length);
    ++state->statistics.tx_packets;
    state->statistics.tx_bytes += packet->length;
    return SPW_OK;
}

static spw_result_t driver_receive(void* raw,
                                   spw_packet_t* packet,
                                   spw_timeout_us_t timeout_us) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    (void)timeout_us;

    if (state == NULL || packet == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    driver_poll_completion(state);
    if (state->rx_owner != STM32_DMA_RX_READY) {
        return SPW_ERR_TIMEOUT;
    }
    if (packet->capacity < state->transfer_length) {
        packet->length = state->transfer_length;
        packet->terminator = state->transfer_terminator;
        return SPW_ERR_BUFFER_TOO_SMALL;
    }
    if (state->transfer_length != 0u && packet->data == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }

    invalidate_cache(g_dma_rx, state->transfer_length);
    bytes_copy(packet->data, g_dma_rx, state->transfer_length);
    packet->length = state->transfer_length;
    packet->terminator = state->transfer_terminator;
    state->rx_owner = STM32_DMA_FREE;
    state->tx_owner = STM32_DMA_FREE;
    ++state->statistics.rx_packets;
    state->statistics.rx_bytes += packet->length;
    return SPW_OK;
}

static spw_result_t driver_get_statistics(const void* raw,
                                          spw_statistics_t* out_statistics) {
    const stm32_driver_state_t* state = (const stm32_driver_state_t*)raw;
    if (state == NULL || out_statistics == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    *out_statistics = state->statistics;
    return SPW_OK;
}

static spw_result_t driver_clear_statistics(void* raw) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    if (state == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    state->statistics = (spw_statistics_t){0};
    return SPW_OK;
}

static spw_driver_buffer_t make_tx_descriptor(const stm32_driver_state_t* state) {
    spw_driver_buffer_t descriptor = {
        g_dma_tx,
        state->transfer_length,
        sizeof(g_dma_tx),
        state->transfer_terminator,
        TX_TOKEN
    };
    return descriptor;
}

static spw_driver_buffer_t make_rx_descriptor(const stm32_driver_state_t* state) {
    spw_driver_buffer_t descriptor = {
        g_dma_rx,
        state->transfer_length,
        sizeof(g_dma_rx),
        state->transfer_terminator,
        RX_TOKEN
    };
    return descriptor;
}

static spw_result_t driver_acquire_tx(void* raw,
                                      size_t min_capacity,
                                      spw_timeout_us_t timeout_us,
                                      spw_driver_buffer_t* out_buffer) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    (void)timeout_us;
    if (state == NULL || out_buffer == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    if (min_capacity > sizeof(g_dma_tx)) {
        return SPW_ERR_RESOURCE_EXHAUSTED;
    }
    if (state->tx_owner != STM32_DMA_FREE || state->rx_owner != STM32_DMA_FREE) {
        return SPW_ERR_RESOURCE_EXHAUSTED;
    }
    state->tx_owner = STM32_DMA_TX_APP;
    state->transfer_length = 0u;
    state->transfer_terminator = SPW_TERMINATOR_EOP;
    *out_buffer = make_tx_descriptor(state);
    return SPW_OK;
}

static spw_result_t driver_submit_tx(void* raw,
                                     const spw_driver_buffer_t* buffer,
                                     spw_timeout_us_t timeout_us) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    (void)timeout_us;
    if (state == NULL || buffer == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    if (state->tx_owner != STM32_DMA_TX_APP ||
        buffer->token != TX_TOKEN || buffer->data != g_dma_tx ||
        buffer->capacity != sizeof(g_dma_tx) || buffer->length > buffer->capacity) {
        return SPW_ERR_BACKEND;
    }

