ExoSpaceLabs/spwkit/integrations/stm32h755_dma/firmware.c
    state->transfer_length = buffer->length;
    state->transfer_terminator = buffer->terminator;
    state->tx_owner = STM32_DMA_TX_DEVICE;
    state->rx_owner = STM32_DMA_RX_DEVICE;
    invalidate_cache(g_dma_rx, buffer->length);
    if (!dma_start_copy(buffer->length)) {
        state->tx_owner = STM32_DMA_TX_APP;
        state->rx_owner = STM32_DMA_FREE;
        return SPW_ERR_BACKEND;
    }
    if (buffer->length == 0u) {
        state->tx_owner = STM32_DMA_TX_COMPLETE;
        state->rx_owner = STM32_DMA_RX_READY;
        ++state->dma_transfers;
        STM32_PROFILE_DMA_COMPLETE();
    }
    ++state->statistics.tx_packets;
    state->statistics.tx_bytes += buffer->length;
    return SPW_OK;
}

static spw_result_t driver_reclaim_tx(void* raw,
                                      spw_timeout_us_t timeout_us,
                                      spw_driver_buffer_t* out_buffer) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    uint32_t spins = STM32_DMA_TIMEOUT_SPINS;
    (void)timeout_us;
    if (state == NULL || out_buffer == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    while (state->tx_owner == STM32_DMA_TX_DEVICE && spins-- != 0u) {
        if (dma_has_error()) {
            return SPW_ERR_BACKEND;
        }
        driver_poll_completion(state);
    }
    if (state->tx_owner != STM32_DMA_TX_COMPLETE) {
        return SPW_ERR_TIMEOUT;
    }
    state->tx_owner = STM32_DMA_TX_APP;
    *out_buffer = make_tx_descriptor(state);
    return SPW_OK;
}

static spw_result_t driver_release_tx(void* raw,
                                      const spw_driver_buffer_t* buffer) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    if (state == NULL || buffer == NULL ||
        state->tx_owner != STM32_DMA_TX_APP ||
        buffer->token != TX_TOKEN || buffer->data != g_dma_tx) {
        return SPW_ERR_BACKEND;
    }
    state->tx_owner = STM32_DMA_FREE;
    return SPW_OK;
}

static spw_result_t driver_acquire_rx(void* raw,
                                      spw_timeout_us_t timeout_us,
                                      spw_driver_buffer_t* out_buffer) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    uint32_t spins = STM32_DMA_TIMEOUT_SPINS;
    (void)timeout_us;
    if (state == NULL || out_buffer == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    while (state->rx_owner == STM32_DMA_RX_DEVICE && spins-- != 0u) {
        if (dma_has_error()) {
            return SPW_ERR_BACKEND;
        }
        driver_poll_completion(state);
    }
    if (state->rx_owner != STM32_DMA_RX_READY) {
        return SPW_ERR_TIMEOUT;
    }
    state->rx_owner = STM32_DMA_RX_APP;
    ++state->statistics.rx_packets;
    state->statistics.rx_bytes += state->transfer_length;
    *out_buffer = make_rx_descriptor(state);
    return SPW_OK;
}

static spw_result_t driver_release_rx(void* raw,
                                      const spw_driver_buffer_t* buffer) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    if (state == NULL || buffer == NULL ||
        state->rx_owner != STM32_DMA_RX_APP ||
        buffer->token != RX_TOKEN || buffer->data != g_dma_rx) {
        return SPW_ERR_BACKEND;
    }
    state->rx_owner = STM32_DMA_FREE;
    return SPW_OK;
}

static spw_result_t driver_sync(void* raw,
                                const spw_driver_buffer_t* buffer,
                                spw_driver_sync_direction_t direction) {
    stm32_driver_state_t* state = (stm32_driver_state_t*)raw;
    if (state == NULL || buffer == NULL) {
        return SPW_ERR_INVALID_ARGUMENT;
    }
    if (direction == SPW_DRIVER_SYNC_TO_DEVICE) {
        clean_cache(buffer->data, buffer->length);
        ++state->sync_to_device;
        return SPW_OK;
    }
    if (direction == SPW_DRIVER_SYNC_FROM_DEVICE) {
        invalidate_cache(buffer->data, buffer->length);
        ++state->sync_from_device;
        return SPW_OK;
    }
    return SPW_ERR_INVALID_ARGUMENT;
}

static const spw_driver_ops_t STM32_DRIVER_OPS = {
    sizeof(spw_driver_ops_t), SPW_DRIVER_OPS_VERSION,
    driver_start, driver_stop, driver_reset,
    driver_get_link_state, driver_get_capabilities,
    driver_send, driver_receive,
    NULL, NULL,
    driver_get_statistics, driver_clear_statistics,
    NULL,
    driver_acquire_tx, driver_submit_tx,
    driver_reclaim_tx, driver_release_tx,
    driver_acquire_rx, driver_release_rx,
    driver_sync
};

#ifdef SPWKIT_STM32_PROFILE
#include "profile_impl.inc"
#endif

static int __attribute__((unused)) run_contract(void) {
    static const uint8_t copied_payload[] = {
        0x53u, 0x70u, 0x57u, 0x4bu, 0x2du, 0x48u, 0x37u, 0x35u, 0x35u
    };
    static const uint8_t zero_copy_payload[] = {
        0x44u, 0x4du, 0x41u, 0x2du, 0x5au, 0x45u, 0x52u, 0x4fu,
        0x2du, 0x43u, 0x4fu, 0x50u, 0x59u
    };
    spw_driver_config_t driver_config =
        SPW_DRIVER_CONFIG_INITIALIZER(&STM32_DRIVER_OPS, &g_driver);
    spw_port_config_t config = SPW_PORT_CONFIG_INITIALIZER(SPW_BACKEND_DRIVER);
    spw_port_workspace_requirements_t requirements = {0u, 0u};
    spw_port_t* port = NULL;
    uint8_t copied_rx[sizeof(copied_payload)] = {0u};
    spw_packet_t copied_tx = {
        (uint8_t*)copied_payload,
        sizeof(copied_payload),
        sizeof(copied_payload),
        SPW_TERMINATOR_EEP
    };
    spw_packet_t copied_packet_rx = {
        copied_rx,
        0u,
        sizeof(copied_rx),
        SPW_TERMINATOR_EOP
    };
    spw_buffer_t* tx_buffer = NULL;
    spw_buffer_t* rx_buffer = NULL;
    spw_buffer_t* reclaimed = NULL;
    spw_buffer_t* stale = NULL;
    spw_buffer_view_t tx_view = {0};
    spw_buffer_view_t rx_view = {0};
    spw_buffer_view_t reclaimed_view = {0};
    spw_buffer_view_t stale_view = {0};
    spw_statistics_t statistics = {0};
    uint8_t* submitted_pointer = NULL;

    driver_config.tx_buffer_slots = 1u;
    driver_config.rx_buffer_slots = 1u;
    config.backend_config = &driver_config;
    config.backend_config_size = sizeof(driver_config);

    g_stm32h755_spwkit_evidence.phase = 1u;
    if (spw_port_workspace_requirements(&config, &requirements) != SPW_OK ||
        requirements.size > sizeof(g_workspace) ||
        requirements.alignment > alignof(max_align_t)) {
        return 0x101;
    }
    if (spw_port_open_in_place(&config, g_workspace, sizeof(g_workspace), &port) != SPW_OK ||
        port == NULL || spw_port_start(port) != SPW_OK) {
        return 0x102;
    }

    g_stm32h755_spwkit_evidence.phase = 2u;
    if (spw_port_send(port, &copied_tx, 50000u) != SPW_OK ||
        spw_port_receive(port, &copied_packet_rx, 50000u) != SPW_OK ||
        copied_packet_rx.length != sizeof(copied_payload) ||
        copied_packet_rx.terminator != SPW_TERMINATOR_EEP ||
        !bytes_equal(copied_payload, copied_rx, sizeof(copied_payload))) {
        return 0x201;
    }

