ExoSpaceLabs/spwkit/integrations/stm32h755_dma/firmware.c
    g_stm32h755_spwkit_evidence.phase = 3u;
    if (spw_port_acquire_tx_buffer(port, sizeof(zero_copy_payload), 50000u, &tx_buffer) != SPW_OK ||
        tx_buffer == NULL ||
        spw_buffer_get_view(tx_buffer, &tx_view) != SPW_OK ||
        tx_view.data != g_dma_tx || tx_view.capacity < sizeof(zero_copy_payload)) {
        return 0x301;
    }
    bytes_copy(tx_view.data, zero_copy_payload, sizeof(zero_copy_payload));
    submitted_pointer = tx_view.data;
    if (spw_buffer_set_packet(tx_buffer, sizeof(zero_copy_payload), SPW_TERMINATOR_EOP) != SPW_OK ||
        spw_port_submit_tx_buffer(port, &tx_buffer, 50000u) != SPW_OK ||
        tx_buffer != NULL) {
        return 0x302;
    }

    g_stm32h755_spwkit_evidence.phase = 4u;
    if (spw_port_acquire_rx_buffer(port, 50000u, &rx_buffer) != SPW_OK ||
        rx_buffer == NULL ||
        spw_buffer_get_view(rx_buffer, &rx_view) != SPW_OK ||
        rx_view.data != g_dma_rx ||
        rx_view.length != sizeof(zero_copy_payload) ||
        rx_view.terminator != SPW_TERMINATOR_EOP ||
        !bytes_equal(rx_view.data, zero_copy_payload, sizeof(zero_copy_payload)) ||
        spw_port_release_rx_buffer(port, &rx_buffer) != SPW_OK || rx_buffer != NULL) {
        return 0x401;
    }

    g_stm32h755_spwkit_evidence.phase = 5u;
    if (spw_port_reclaim_tx_buffer(port, 50000u, &reclaimed) != SPW_OK ||
        reclaimed == NULL ||
        spw_buffer_get_view(reclaimed, &reclaimed_view) != SPW_OK ||
        reclaimed_view.data != submitted_pointer ||
        spw_port_release_tx_buffer(port, &reclaimed) != SPW_OK || reclaimed != NULL) {
        return 0x501;
    }

    g_stm32h755_spwkit_evidence.phase = 6u;
    if (g_driver.sync_to_device == 0u || g_driver.sync_from_device == 0u ||
        g_driver.dma_transfers < 2u ||
        spw_port_get_statistics(port, &statistics) != SPW_OK ||
        statistics.tx_packets < 2u || statistics.rx_packets < 2u) {
        return 0x601;
    }

    g_stm32h755_spwkit_evidence.phase = 7u;
    if (spw_port_acquire_tx_buffer(port, 8u, SPW_TIMEOUT_IMMEDIATE, &stale) != SPW_OK ||
        stale == NULL ||
        spw_buffer_get_view(stale, &stale_view) != SPW_OK) {
        return 0x701;
    }
    if (spw_port_reset(port) != SPW_OK) {
        return 0x702;
    }
    if (spw_buffer_get_view(stale, &stale_view) != SPW_ERR_INVALID_STATE) {
        return 0x703;
    }
    g_stm32h755_spwkit_evidence.reset_stale_invalidated = 1u;

    if (spw_port_close(port) != SPW_OK) {
        return 0x704;
    }

    g_stm32h755_spwkit_evidence.sync_to_device = g_driver.sync_to_device;
    g_stm32h755_spwkit_evidence.sync_from_device = g_driver.sync_from_device;
    g_stm32h755_spwkit_evidence.dma_transfers = g_driver.dma_transfers;
    g_stm32h755_spwkit_evidence.tx_packets = (uint32_t)statistics.tx_packets;
    g_stm32h755_spwkit_evidence.rx_packets = (uint32_t)statistics.rx_packets;
    return 0;
}

void Reset_Handler(void) {
    int result;

    __disable_irq();
    memory_init();
    SCB->VTOR = (uint32_t)(uintptr_t)g_stm32h755_vector_table;

    /* Enable DMA2 on the D2 AHB1 bus. The reset clock configuration is enough
     * for this standalone memory-to-memory evidence firmware. */
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;
    (void)RCC->AHB1ENR;

    SCB_EnableICache();
    SCB_EnableDCache();

    g_driver.link_state = SPW_LINK_ERROR_RESET;
    g_driver.tx_owner = STM32_DMA_FREE;
    g_driver.rx_owner = STM32_DMA_FREE;

#ifdef SPWKIT_STM32_PROFILE
    g_stm32h755_spwkit_profile.magic = STM32_PROFILE_MAGIC;
    g_stm32h755_spwkit_profile.result = UINT32_C(0xfffffffe);
    result = run_profile();
    g_stm32h755_spwkit_profile.result = (uint32_t)result;
    g_stm32h755_spwkit_profile.phase =
        result == 0 ? 0x700du : 0xdead0000u | (uint32_t)result;
#else
    g_stm32h755_spwkit_evidence.magic = STM32_EVIDENCE_MAGIC;
    g_stm32h755_spwkit_evidence.result = UINT32_C(0xfffffffe);
    result = run_contract();
    g_stm32h755_spwkit_evidence.result = (uint32_t)result;
    g_stm32h755_spwkit_evidence.phase =
        result == 0 ? 0x700du : 0xdead0000u | (uint32_t)result;
#endif
    __DSB();

    for (;;) {
        __NOP();
    }
}
